#!/bin/bash

#---------------------------------------------------------------
# ping_net: скрипт проверяет (пингует) доступность хостов в сети 
#---------------------------------------------------------------

#---------------------------------------------------------------
# Константы:
# @net - диапазон проверяемых хостов в формате ip-адрес сети
#---------------------------------------------------------------

# --- Инициализируем константы ---
net="10.199.192"

# --- Функция обработки ошибок ---
function printError {
  echo "[$(date)] Ошибка! Работа скрипта аварийно прервана"
  exit -1
}

# --- Выводим баннер скрипта ---
echo "-----------------------------------------------------"
echo "ping_net.sh - анализ доступности хостов заданной сети"
echo "-----------------------------------------------------"

# --- Выводим сообщение о начале работы скрипта ---
echo "[$(date)] Анализ доступности хостов начат:"

# --- Проверяем хосты сети по очереди на доступность ---
for i in {45..75};
do
  {
    if [[ $((  $i % 5 )) -eq 0 ]]
      then 
        echo -ne "\r    " 
        echo -ne "\r"
    else
        echo -n "."
    fi
    ping -c1 -W1  $net.$i &>/dev/null && echo -e "\r- хост $net.$i доступен"
  }
done

# --- Выводим сообщение о завершении работы скрипта ---
echo -ne "\r[$(date)] Анализ завершен"
echo

# --- Формируем код возврата "Ок" ---
exit 0