#!/bin/bash

#--------------------------------------------------------------
# get_ssh_failed: скрипт анализирует логи  на предмет неудачных 
#                 попыток входа по SSH
#--------------------------------------------------------------

#--------------------------------------------------------------
# Константы:
# @logFilePath    - путь к анализируемому лог-файлу
# @countTopOutput - кол-во IP-адресов в топ вывода
# @outPipe        - выходной список IP-адресов, удовлетворяющий
#                   требованиям
#--------------------------------------------------------------

# --- Инициализируем константы ---
logFilePath="/var/log/secure"
countTopOutput=10
outPipe=""

# --- Функция обработки ошибок ---
function printError {
  echo "[$(date)] Ошибка! Работа скрипта аварийно прервана"
  exit -1
}

# --- Выводим баннер скрипта ---
echo "-------------------------------------------------------------"
echo "get_ssh_failed: скрипт анализирует логи  на предмет неудачных" 
echo "попыток входа по SSH"
echo "-------------------------------------------------------------"

# --- Выводим сообщение о начале работы скрипта ---
echo "[$(date)] Анализ системных журналов начат"
echo

# --- Анализируем лог-файлы --- 
echo "Топ $countTopOutput IP адреса(ов) с неудачными попытками входа по SSH:"
outPipe=$(grep -E "Failed password for" "$logFilePath" | grep -oP '(?<=from )[\d\.]+' | sort | uniq -c | sort -rn | head -n "$countTopOutput") || printError

if [[ $outPipe == "" ]] 
then
  echo "- неудачные попытки входа по SSH отсутствуют"
else
  echo "$outPipe"
fi
echo

# --- Выводим сообщение о завершении работы скрипта ---
echo "[$(date)] Анализ завершен"

# --- Формируем код возврата "Ок" ---
exit 0