#!/bin/bash

#-------------------------------------------------------------
# get_top_proc: скрипт мониторинг топ-10 процессов, занимающих
#               наиболее загружающих систему по параметрам CPU
#               и Mem
#--------------------------------------------------------------

#--------------------------------------------------------------
# Константы:
# @topLvl - кол-во процессов топ, которые мониторятся
#--------------------------------------------------------------

# --- Инициализируем константы ---
topLvl=11 # head + top-10

# --- Функция обработки ошибок ---
function printError {
  echo "[$(date)] Ошибка! Работа скрипта аварийно прервана"
  exit -1
}

# --- Выводим баннер скрипта ---
echo "-------------------------------------------------------------"
echo " get_top_proc: скрипт мониторинг топ-10 процессов, занимающих"
echo "               наиболее загружающих систему по параметрам CPU"
echo "               и Mem"
echo "-------------------------------------------------------------"

# --- Выводим сообщение о начале работы скрипта ---
echo "[$(date)] Анализ процессов начат:"
echo ""

# --- Выводим тор-10 процессов по CPU ---
ps -eo pid,ppid,cmd,%cpu --sort=-%cpu | head -n $topLvl || printError
echo ""

# --- Выводим тор-10 процессов по Mem ---
ps -eo pid,ppid,cmd,%mem --sort=-%mem | head -n $topLvl || printError
echo ""

# --- Выводим сообщение о завершении работы скрипта ---
echo "[$(date)] Анализ завершен"

# --- Формируем код возврата "Ок" ---
exit 0