#!/bin/bash

#-------------------------------------------------------------------
# get_performance: скрипт с заданной периодичностью выводит загрузку
#                 CPU, RAM
#-------------------------------------------------------------------

#-------------------------------------------------------------------
# Константы:
# @interval - интервал обновления данных в секундах
#-------------------------------------------------------------------

# --- Инициализируем константы ---
interval=1

# --- Функция обработки ошибок ---
function printError {
  echo "[$(date)] Ошибка! Работа скрипта аварийно прервана"
  exit -1
}

# --- Выводим баннер скрипта ---
echo "--------------------------------------------"
echo "get_performance.sh - вывод загрузки CPU, RAM"
echo "--------------------------------------------"

# --- Выводим сообщение о начале работы скрипта ---
echo "[$(date)] Анализ нагрузки начат:"
# --- Выводим заголовок таблицы ---
printf "CPU load\tRAM load\n"
printf "________\t________\n"

# --- В цикле получаем данные о нагрузке ---
while ! read -s -n 1 -t $interval
do
  # --- Нагрузка на CPU ---
  mpstat 1 1 | awk '/Среднее:/ {printf("%7.2f%%", 100 - $NF)}'
  # --- Загрузка RAM ---
  free --mega | awk '/Mem:/ {printf("\t%7.2f%%\n", ( $2 - $7 ) / $2 * 100 )}'
done

# --- Выводим сообщение о завершении работы скрипта ---
printf "________\t________\n"
echo "[$(date)] Анализ нагрузки завершен"

# --- Формируем код возврата "Ок" ---
exit 0
