#!/bin/bash

#--------------------------------------------------------
# get_users: скрипт выводит отчет о пользователях системы 
#--------------------------------------------------------

# --- Функция обработки ошибок ---
function printError {
  echo "[$(date)] Ошибка! Работа скрипта аварийно прервана"
  exit -1
}

# --- Выводим баннер скрипта ---
echo "---------------------------------------------------"
echo "get_users.sh - вывод отчета о пользователях системы"
echo "---------------------------------------------------"

# --- Выводим сообщение о начале работы скрипта ---
echo "[$(date)] Анализ информации о пользователях системы:"
echo

# --- Выводим заголовок таблицы ---
printf "%-20s\t%6s\t%-25s\n" "-------------------" "------" "------------------------"
printf "%-20s\t%6s\t%-25s\n" "      User name" "  Uid" "      Last login"
printf "%-20s\t%6s\t%-25s\n" "-------------------" "------" "------------------------"

# --- Читаем файл passwd ---
cut -d: -f1,3,6 /etc/passwd | \
  while IFS=: read user uid home
    do
      printf "%-20s\t%6s\t" $user $uid || printError
      echo $(last -n 1 'user_lc' | awk '!/^$/' | head -n 1 | awk '{ printf "%3s %3s %2s %8s %4s\n", $3, $4, $5, $6, $7}') || printError
    done || printError 

# --- Выводим сообщение о завершении работы скрипта ---
printf "%-20s\t%6s\t%-25s\n" "-------------------" "------" "------------------------"
echo "[$(date)] Анализ завершен"

# --- Формируем код возврата "Ок" ---
exit 0